<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>

	
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

	
  <meta name="AppleTitle" content="Disk Inventory X Help">

	
  <meta name="AppleIcon" content="Help/images/DiskInventoryXIcon.jpg">

	
  <meta name="copyright" content="Copyright 2004 Tjark Derlien. All rights reserved.">

	
  <link href="styles/task_style.css" rel="stylesheet" media="all">

	
  <title>Disk Inventory X Help</title>
</head>


<body>

<h1>D&eacute;marrage</h1>

<p>Ouvrez le menu&nbsp;"Fichier" et s&eacute;lectionnez&nbsp;"Ouvrir
dossier...". S&eacute;lectionnez tous les dossiers ou volume que vous
voulez analyser. Une fen&ecirc;tre va s'ouvrir en affichant "Chargement
de&nbsp;bla bla". Soyez patient si vous avez s&eacute;lectionn&eacute;
un gros dossier ou tout un volume avec beaucoup de fichiers et dossiers.<br>
D&egrave;s que le chargement est termin&eacute; (la fen&ecirc;tre de
suivi a disparu) la fen&ecirc;tre principale va s'ouvrir et vous voyez
sur la moiti&eacute; gauche une vue du style Finder du dossier/volume
s&eacute;lectionn&eacute; et sur la moiti&eacute; droite une vue
graphique&nbsp;:</p>

<p><img src="images/overview.jpg" height="452" width="862"></p>

<p>(1) Cette vue de style Finder montre les fichiers et dossiers avec leur tailles.<br>
(2) La carte montre les fichiers et dossiers d'une fa&ccedil;on qui met
en &eacute;vidence quels fichiers et dossiers occupent le plus de
place. La s&eacute;lection dans la liste des fichiers/dossiers et la
carte est synchronis&eacute;e. (Voir&nbsp;(4) pour la signification des
diff&eacute;rentes couleurs.)<br>

  (3) Ici quelques informations sur le fichier point&eacute; sur la carte.<br>
(4) Les statistiques par type de fichier donnent le nombre de fichiers
pour un type sp&eacute;cifique et la somme de leur tailles. La liste
est tri&eacute;e par taille en ordre d&eacute;croissant. Chaque type de
fichier a une couleur qui est aussi utilis&eacute;e dans la carte (2).
La m&ecirc;me couleur est utilis&eacute;e pour chaque type pour tous
les dossiers ouverts (voir ci-dessous).</p>

<p>Dans le menu&nbsp;"Affichage" vous pouvez choisir si vous
pr&eacute;f&eacute;rez voir le contenu des paquets, vous pouvez zoomer
dans les dossiers et quelques autres choses qui aideront &agrave;
analyser l'utilisation de l'espace disque.</p>

<h1>Un mot sur l'utilisation des couleurs</h1>

<p> Disk Inventory X a 12 couleurs pr&eacute;d&eacute;finies qui sont
affect&eacute;es au 12 "plus gros types" (l'id&eacute;e derri&egrave;re
&ccedil;a est qu'il est de plus en plus difficile de distinguer les
couleurs si elles sont plus de 12). <br>
Le reste des types utilisent la couleur grise. Cette affectation de
couleur est faite pour tous les dossiers ouverts (l'affectation de
couleur est partag&eacute;e) : les fichiers du m&ecirc;me type ont la
m&ecirc;me couleur dans tous les dossiers ouverts.<br>
Donc si vous chargez le premier dossier, les 12 couleurs peuvent
&ecirc;tre affect&eacute;es &agrave; des types (si le dossier contient
des fichiers d'au moins 12 types diff&eacute;rents). Si vous ouvrez
ensuite un deuxi&egrave;me dossier avec des types totalement
diff&eacute;rents, il ne reste plus de couleur et tous les types du
deuxi&egrave;me dossier utilisent la couleur grise. <br>
Le seul moyen de refaire les affectations est actuellement de red&eacute;marrer DIX.</p>

</body>
</html>
